In [1]:
##sqlite 세팅
import sqlite3

conn = sqlite3.connect("w1m2.db")
cur = conn.cursor()

## Demo customers table
cur.execute("""create table if not exists Customers(
            CustomerID INTEGER PRIMARY KEY, 
            CustomerName TEXT, 
            ContactName TEXT, 
            Address TEXT, 
            City TEXT, 
            PostalCode TEXT, 
            Country TEXT
            )""")

cur.execute("INSERT OR IGNORE INTO Customers VALUES (1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')")
cur.execute("INSERT OR IGNORE INTO Customers VALUES (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')")
cur.execute("INSERT OR IGNORE INTO Customers VALUES (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')")
cur.execute("INSERT OR IGNORE INTO Customers VALUES (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')")
cur.execute("INSERT OR IGNORE INTO Customers VALUES (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')")

In [2]:
#select
cur.execute("SELECT * FROM Customers")
data = cur.fetchall()

for row in data:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')

In [3]:
#select2
cur.execute("SELECT CustomerName, City FROM Customers")
data = cur.fetchall()

for row in data:
    print(row)

('Alfreds Futterkiste', 'Berlin')
('Ana Trujillo Emparedados y helados', 'México D.F.')
('Antonio Moreno Taquería', 'México D.F.')
('Around the Horn', 'London')
('Berglunds snabbköp', 'Luleå')

In [4]:
#distinct
cur.execute("SELECT DISTINCT Country FROM Customers")
data = cur.fetchall()

for row in data:
    print(row)

cur.execute("SELECT COUNT(DISTINCT Country) FROM Customers")
data = cur.fetchone()

print(data)

('Germany',)
('Mexico',)
('UK',)
('Sweden',)
(4,)

In [5]:
#where
cur.execute("SELECT * FROM Customers WHERE Country='Mexico'")
data = cur.fetchall()
for row in data:
    print(row)


cur.execute("SELECT * FROM Customers WHERE CustomerID =1")
data = cur.fetchall()
for row in data:
    print(row)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')

In [6]:
#order by asc|desc

cur.execute("SELECT * FROM Customers ORDER BY Country, CustomerName")
data = cur.fetchall()
for row in data:
    print(row)

cur.execute("SELECT * FROM Customers ORDER BY Country ASC, CustomerName DESC")
data = cur.fetchall()
for row in data:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

In [7]:
#and 
cur.execute("SELECT * FROM Customers WHERE Country ='Spain' AND CustomerName LIKE 'G%'")
data = cur.fetchall()
for row in data:
    print(row)

In [8]:
#or
cur.execute("SELECT * FROM Customers WHERE Country ='Germany' OR Country ='Spain'")
data= cur.fetchall()
for row in data:
    print(row)


cur.execute("SELECT * FROM Customers WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')")
data = cur.fetchall()
for row in data:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')

In [9]:
#not
cur.execute("SELECT * FROM Customers WHERE NOT Country = 'Spain'")
data = cur.fetchall()
for row in data:
    print(row)
print('=' * 60)
cur.execute("SELECT * FROM Customers WHERE CustomerName NOT LIKE 'A%'")
data = cur.fetchall()
for row in data:
    print(row)
print('=' * 60)
cur.execute("SELECT * FROM Customers WHERE CustomerID NOT BETWEEN 2 AND 4")
data = cur.fetchall()
for row in data:
    print(row)
print('=' * 60)
cur.execute("SELECT * FROM Customers WHERE Country NOT IN ('Sweden', 'Paris')")
data = cur.fetchall()
for row in data:
    print(row)
print('=' * 60)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
============================================================
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
============================================================
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
============================================================
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
============================================================

In [10]:
#inser into 'table_name' values ()

cur.execute("INSERT OR IGNORE INTO Customers VALUES (92,'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')")
cur.execute("SELECT * FROM Customers")
data = cur.fetchall()
for row in data:
    print(row)


cur.execute("INSERT OR IGNORE INTO Customers (CustomerName, City, Country) VALUES ('Wolski','Walla', 'Poland')")
cur.execute("SELECT * FROM Customers")
data = cur.fetchall()
for row in data:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(93, 'Wolski', None, None, 'Walla', None, 'Poland')

In [11]:
#null
cur.execute("SELECT CustomerName, ContactName, Address FROM Customers WHERE Address is NULL")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)
cur.execute("SELECT CustomerName, ContactName, Address FROM Customers WHERE Address IS NOT NULL")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

('Wolski', None, None)
============================================================
('Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57')
('Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222')
('Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312')
('Around the Horn', 'Thomas Hardy', '120 Hanover Sq.')
('Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8')
('Cardinal', 'Tom B. Erichsen', 'Skagen 21')
============================================================

In [12]:
#update set where 
cur.execute("UPDATE Customers SET ContactName = 'Alfreds Schmidt', City = 'Frankfurt' WHERE CustomerID = 1")
cur.execute("select * from Customers")
data = cur.fetchall()
for row in data:
    print(row)

# where 절 생략시 모든 레코드 업데이트됨

(1, 'Alfreds Futterkiste', 'Alfreds Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(93, 'Wolski', None, None, 'Walla', None, 'Poland')

In [13]:
#delete from where
#where절 생략시 모든 레코드 삭제
#table 완전삭제 -> drop
#table 스키마는 두고 레코드 삭제 -> turncate (where절 안 쓴 delete랑 같은 효과)
cur.execute("DELETE FROM Customers WHERE CustomerName = 'Alfreds Futterkiste'")
cur.execute("select * from Customers")
data = cur.fetchall()
for row in data:
    print(row)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(93, 'Wolski', None, None, 'Walla', None, 'Poland')

TOP ->mysql 지원 X
cur.execute("SELECT TOP 3 * FROM Customers")

In [14]:
#Products Table
cur.execute("""
    CREATE TABLE IF NOT EXISTS Products (
        ProductID INTEGER PRIMARY KEY,
        ProductName TEXT,
        SupplierID INTEGER,
        CategoryID INTEGER,
        Unit TEXT,
        Price REAL
    )
""")

products_data = [
    (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18.0),
    (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0),
    (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0),
    (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0),
    (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
]

cur.executemany("INSERT OR IGNORE INTO Products VALUES (?, ?, ?, ?, ?, ?)", products_data)

In [15]:
#min, max
cur.execute("SELECT MAX(Price) FROM Products")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

cur.execute("SELECT MIN(Price) AS SmallestPrice, CategoryID FROM Products GROUP BY CategoryID")
data = cur.fetchall()
for row in data:
    print(row)

(22.0,)
============================================================
(18.0, 1)
(10.0, 2)

In [16]:
#count(*) -> 전체 레코드 수
cur.execute("SELECT COUNT(*) FROM Products")
data = cur.fetchall()
for row in data:
    print(row)

# count(컬럼명) 지정 시 null값인 것 개수 세지 않음
cur.execute("SELECT Count(ProductName) FROM Products")
data = cur.fetchall()
for row in data:
    print(row)


cur.execute("SELECT Count(ProductID) FROM Products WHERE Price > 20")
data = cur.fetchall()
for row in data:
    print(row)


cur.execute("SELECT COUNT(*) AS [Number of records], CategoryID FROM Products GROUP BY  CategoryID")
data = cur.fetchall()
for row in data:
    print(row)

(5,)
(5,)
(2,)
(2, 1)
(3, 2)

In [17]:
#OrderDetails table
cur.execute("""
    CREATE TABLE IF NOT EXISTS OrderDetails (
        OrderDetailID INTEGER PRIMARY KEY,
        OrderID INTEGER,
        ProductID INTEGER,
        Quantity INTEGER
    )
""")

products_data = [
    (1, 10248, 11, 12),
    (2, 10248, 42, 10),
    (3, 10248, 72, 5),
    (4, 10249, 14, 9),
    (5, 10249, 51, 40)
]

cur.executemany("INSERT OR IGNORE INTO OrderDetails VALUES (?, ?, ?, ?)", products_data)

In [18]:
#sum
cur.execute("SELECT SUM(Quantity) FROM OrderDetails WHERE ProductID = 11")
data = cur.fetchall()
for row in data:
    print(row)

cur.execute("SELECT SUM(Price*Quantity) FROM OrderDetails LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID")
data = cur.fetchall()
for row in data:
    print(row)

(12,)
(None,)

In [19]:
cur.execute("SELECT AVG(Price) FROM Products")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

cur.execute("SELECT * FROM Products WHERE Price > (SELECT AVG(Price) FROM Products)")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

cur.execute("SELECT AVG(Price) FROM Products GROUP BY CategoryID")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

(18.07,)
============================================================
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)
============================================================
(18.5,)
(17.783333333333335,)
============================================================

In [20]:
#LIKE wildcards
cur.execute("SELECT * FROM Customers where CustomerName LIKE 'A%'")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

cur.execute("SELECT * FROM Customers where City LIKE 'L_nd__'")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

cur.execute("SELECT * FROM Customers where CustomerName LIKE 'a__%'")
data = cur.fetchall()
for row in data:
    print(row)
print("="*60)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
============================================================
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
============================================================
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
============================================================

In [21]:
#IN
cur.execute("Select * FROM Customers where Country in ('Germany', 'France', 'UK')")
data = cur.fetchall()
for row in data:
    print(row)


cur.execute("Select * FROM Customers where Country not in ('Germany', 'France', 'UK')")
data = cur.fetchall()
for row in data:
    print(row)

(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(93, 'Wolski', None, None, 'Walla', None, 'Poland')

In [22]:
#between

cur.execute("select * from Products where Price between 10 and 20")
cur.execute("select * from Products where Price between 10 and 20 and CategoryID in (1,2,3) ")
cur.execute("select * from Products WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni' ORDER BY ProductName")

data = cur.fetchall()
for row in data:
    print(row)

(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18.0)
(2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0)
(4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0)
(5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)

In [23]:
#Orders table

cur.execute("""
    CREATE TABLE IF NOT EXISTS Orders
        (OrderID INTEGER PRIMARY KEY,
        CustomerID INTEGER,
            EmployeeID INTEGER,
            OrderDate TEXT,
            ShipperID INTEGER
        )
            """)
orders_data = [
        (10248, 92, 5, '1996-07-04', 3),
        (10249, 81, 6, '1996-07-05', 1),
        (10250, 93, 4, '1996-07-08', 2),
        (10251, 84, 3, '1996-07-09', 1),
        (10252, 76, 4, '1996-07-10', 2)
    ]
cur.executemany("""
        INSERT OR IGNORE INTO Orders 
        (OrderID, CustomerID, EmployeeID, OrderDate, ShipperID) 
        VALUES (?, ?, ?, ?, ?)
    """, orders_data)

In [24]:
#inner join
cur.execute("SELECT o.OrderID, c.CustomerName, o.OrderDate FROM Orders as o INNER JOIN Customers as c ON o.CustomerID = c.CustomerID")

data = cur.fetchall()
for row in data:
    print(row)

(10248, 'Cardinal', '1996-07-04')
(10250, 'Wolski', '1996-07-08')

In [25]:
#left join
cur.execute("SELECT c.CustomerName, o.OrderID FROM Customers as c left join Orders as o on c.CustomerID = o.CustomerID ORDER BY c.CustomerName")
data = cur.fetchall()
for row in data:
    print(row)

('Ana Trujillo Emparedados y helados', None)
('Antonio Moreno Taquería', None)
('Around the Horn', None)
('Berglunds snabbköp', None)
('Cardinal', 10248)
('Wolski', 10250)

In [26]:
#right Join
cur.execute("SELECT c.CustomerName, o.OrderID FROM Customers as c right join Orders as o on c.CustomerID = o.CustomerID ORDER BY c.CustomerName")
data = cur.fetchall()
for row in data:
    print(row)

(None, 10249)
(None, 10251)
(None, 10252)
('Cardinal', 10248)
('Wolski', 10250)

In [27]:
#full outer JOin
#FULL OUTER JOIN , FULL JOIN 두 개 같음.
cur.execute("SELECT c.CustomerName, o.OrderID FROM Customers as c full outer join Orders as o on c.CustomerID = o.CustomerID ORDER BY c.CustomerName")
data = cur.fetchall()
for row in data:
    print(row)

(None, 10249)
(None, 10251)
(None, 10252)
('Ana Trujillo Emparedados y helados', None)
('Antonio Moreno Taquería', None)
('Around the Horn', None)
('Berglunds snabbköp', None)
('Cardinal', 10248)
('Wolski', 10250)

In [28]:
#self join
cur.execute("select a.CustomerName , b.CustomerName as CustomerName2, a.City from Customers A, Customers B where a.CustomerID <> b.CustomerID AND a.City == b.City Order by a.City")
data = cur.fetchall()
for row in data:
    print(row)

('Ana Trujillo Emparedados y helados', 'Antonio Moreno Taquería', 'México D.F.')
('Antonio Moreno Taquería', 'Ana Trujillo Emparedados y helados', 'México D.F.')

In [29]:
#union

cur.execute("""
    select CustomerID FROM Customers
    union
    select CustomerID FROM Orders
""")
data = cur.fetchall()
for row in data:
    print(row)

(2,)
(3,)
(4,)
(5,)
(76,)
(81,)
(84,)
(92,)
(93,)

In [30]:
#union all
cur.execute("""
    select CustomerID FROM Customers
    union all
    select CustomerID FROM Orders
    order by CustomerID
""")
data = cur.fetchall()
for row in data:
    print(row)

(2,)
(3,)
(4,)
(5,)
(76,)
(81,)
(84,)
(92,)
(92,)
(93,)
(93,)

In [31]:
#group by
cur.execute("""
    select count(CustomerID), Country
    from Customers
    group by Country
    order by Count(CustomerID) DESC  

""")
data = cur.fetchall()
for row in data:
    print(row)

(2, 'Mexico')
(1, 'UK')
(1, 'Sweden')
(1, 'Poland')
(1, 'Norway')

In [32]:
#having
cur.execute("""
    select count(CustomerID), Country
    from Customers
    group by Country
    having Count(CustomerID) > 1
    order by Count(CustomerID) DESC  

""")
data = cur.fetchall()
for row in data:
    print(row)

(2, 'Mexico')

In [33]:
#Suppliers table
cur.execute("""
    create table if not exists Suppliers(
        SupplierID INTEGER PRIMARY KEY,
        SupplierName TEXT,
        ContactName TEXT,
        Address TEXT,
        City TEXT,
        PostalCode TEXT,
        Country TEXT
    )
""")

suppliers_data = [
    (1, 'Exotic Liquid', 'Charlotte Cooper', '49 Gilbert St.', 'London', 'EC1 4SD', 'UK'),
    (2, 'New Orleans Cajun Delights', 'Shelley Burke', 'P.O. Box 78934', 'New Orleans', '70117', 'USA'),
    (3, "Grandma Kelly's Homestead", 'Regina Murphy', '707 Oxford Rd.', 'Ann Arbor', '48104', 'USA'),
    (4, 'Tokyo Traders', 'Yoshi Nagase', '9-8 Sekimai Musashino-shi', 'Tokyo', '100', 'Japan')
]

cur.executemany("""
    INSERT OR IGNORE INTO Suppliers 
    VALUES (?, ?, ?, ?, ?, ?, ?)
""", suppliers_data)

In [34]:
#exists

cur.execute("""
    select SupplierName from Suppliers where exists (select ProductName FROM Products where Products.SupplierID = Suppliers.supplierID and Price < 20)
""")
data = cur.fetchall()
for row in data:
    print(row)

('Exotic Liquid',)

In [35]:
#any all
#지원x
# cur.execute("""
#     select ProductName
#     from Products
#     where ProductID  = ANY (select ProudctID from OrderDetails where Quantity > 10)
# """)
# data = cur.fetchall()
# for row in data:
#     print(row)
# cur.execute("""
#     select ProductName
#     from Products
#     where ProductID  = ALL (select ProudctID from OrderDetails where Quantity > 10)
# """)
# data = cur.fetchall()
# for row in data:
#     print(row)

In [36]:
#select into
#지원x
#cur.execute("select * into CustomerBackup2017 from Customers")

In [37]:
#insert into
cur.execute("""
insert into Customers (CustomerName, City, Country)
select SupplierName, City, Country From Suppliers
""")
cur.execute("select * from Customers")
data =cur.fetchall()
for row in data:
    print(row)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '05021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '05023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')
(93, 'Wolski', None, None, 'Walla', None, 'Poland')
(94, 'Exotic Liquid', None, None, 'London', None, 'UK')
(95, 'New Orleans Cajun Delights', None, None, 'New Orleans', None, 'USA')
(96, "Grandma Kelly's Homestead", None, None, 'Ann Arbor', None, 'USA')
(97, 'Tokyo Traders', None, None, 'Tokyo', None, 'Japan')

In [38]:
#case
cur.execute("""
select OrderID, Quantity,
case
    when Quantity > 30 Then 'The quantity is greater than 30'
    when Quantity = 30 Then 'The quantity is 30'
    ELSE 'THE Quantity is under 30'
END AS QuantityText
FROM OrderDetails
""")
data =cur.fetchall()
for row in data:
    print(row)

(10248, 12, 'THE Quantity is under 30')
(10248, 10, 'THE Quantity is under 30')
(10248, 5, 'THE Quantity is under 30')
(10249, 9, 'THE Quantity is under 30')
(10249, 40, 'The quantity is greater than 30')

In [39]:
#null func
#ifnull, coalesce
cur.execute("""
    select ProductName, IFNULL(Unit, 0) from Products
""")
data =cur.fetchall()
for row in data:
    print(row)

('Chais', '10 boxes x 20 bags')
('Chang', '24 - 12 oz bottles')
('Aniseed Syrup', '12 - 550 ml bottles')
("Chef Anton's Cajun Seasoning", '48 - 6 oz jars')
("Chef Anton's Gumbo Mix", '36 boxes')

In [40]:
#Procedures
#sqlite 지원X
# cur.execute("""
# create procedure SelectAllCustomers as select * from Customers go
# """)
# cur.execute("exec SelectAllCustomers")

# data =cur.fetchall()
# for row in data:
#     print(row)

In [41]:
--comments
/*
주석주석주석주석주석주석
주석주석주석주석주석주석
*/

SyntaxError: invalid syntax (335443056.py, line 5)

In [42]:
conn.commit()
conn.close()